{
  "about": "## About Me\n\nHello! I'm **Nimisha G J**, a software developer with 1 year of experience.\n\nI'm currently working on observability solutions at Infraspec, helping companies monitor and understand their systems better.\n\nI'm passionate about building robust backend systems and cloud infrastructure.\n\nWhen I'm not coding, you'll find me exploring the outdoors through trekking, traveling, and bike riding. As a computer science engineering student, I'm on a continuous journey to expand my knowledge and contribute to the ever-evolving tech landscape. Let's connect and build something incredible together!",
  "skills": "## Skills\n\n**Languages:**\nJavaScript, TypeScript, Python, Go, C++, Java, Ruby\n\n**Frontend:**\nHTML, CSS, React, Svelte, Next.js\n\n**Backend:**\nExpress, FastAPI, Rails, BentoML\n\n**Databases:**\nMySQL, PostgreSQL, ClickHouse, Redis\n\n**DevOps & Cloud:**\nDocker, Kubernetes, AWS (ECS, EKS, EC2, VPC, S3, CloudWatch), Linux\n\n**Observability:**\nOpenTelemetry, FluentBit, Jaeger, Grafana, Prometheus\n\n**Others:**\nFigma, Jest, RabbitMQ",
  "experience": "## Experience\n\n**Software Engineer at Infraspec (July 2024 - Present)**\n• Working on observability solutions\n• Created a payout management system from scratch\n• Implemented a complete EKS setup with ingress controller\n• Extensive work on Go backend\n• Set up complete observability for company clients\n\n**Software Development Intern at Infraspec (January 2024 - April 2024)**\n• Developed an expense management application using Rails\n• Configured netbooting for Raspberry Pi\n• Set up ECS infrastructure",
  "projects": "## Projects\n\n**Payout Management System (Infraspec)**\nDeveloped a system from scratch to handle and automate payment distributions.\n\n**Kubernetes Infrastructure (Infraspec)**\nImplemented a complete EKS setup with ingress controller for robust containerized applications.\n\n**Expense Management Application (Infraspec Internship)**\nBuilt a Rails-based expense tracking application for my company that streamlines the expense report process.\n\n**Raspberry Pi Netboot Configuration (Infraspec Internship)**\nSet up a network boot solution for Raspberry Pi devices to enable diskless booting.\n\n**Client Observability Platform**\nHelped clients set up comprehensive observability solutions to monitor their applications.",
  "contact": "## Contact Information\n\n$ GitHub: https://github.com/nimishgj\n\n$ LinkedIn: https://linkedin.com/in/nimishagj\n\n$ Email: nimishgj444@gmail.com"
}
